package home.work;

public class lesson2 {
    public static void main(String[] args) {
        // Создать переменные всех пройденных типов данных, и инициализировать их значения;
        byte valByte = 120;
        System.out.println("значение от -128 до 127 - " + valByte);
        short val0 = 12442;
        System.out.println("значение от -32768 до 32767 - " + val0);
        int a = 1000;
        System.out.println("значение от -2147483648 до 2147483647 - " + a);
        long b = 77777L;
        System.out.println("значение от -9223372036854775808 до до 9223372036854775807 - " + b);
        float val1 = 777.0f;
        System.out.println("int только с ,0 - " + val1);
        double val2 = 777.777;
        System.out.println("int только с ,00 - " + val2);
        char d ='d';
        System.out.println("Один символ - " + d);
        boolean yesno = true;
        System.out.println("True | False - " + yesno);

    }
}
